Autodesk.Revit.DB.ReferencePlane.Flip
Flips the orientation of the reference plane.

Autodesk.Revit.DB.ReferencePlane.GetReference
Returns the geometry reference of the reference plane.
Returns:
The geometry reference of the reference plane.
Since:
2016

Autodesk.Revit.DB.ReferencePlane.GetPlane
Returns the geometry plane to which the reference plane is assigned.
Returns:
The geometry plane to which the reference plane is assigned.
Since:
2016

Autodesk.Revit.DB.ReferencePlane.Direction
The direction of the reference plane.
Remarks:
When setting this property, an exception will be thrown if the direction vector is not perpendicular to the normal vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: newDir has zero length.

Autodesk.Revit.DB.ReferencePlane.Normal
The normal vector of the reference plane.

Autodesk.Revit.DB.ReferencePlane.FreeEnd
The free end of the reference plane.
Remarks:
When setting this property, an exception will be thrown if the free end is set to
almost the same point as bubble end or if the vector from BubbleEnd -> FreeEnd is not perpendicular
to the normal vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.ReferencePlane.BubbleEnd
The bubble end of the reference plane.
Remarks:
When setting this property, an exception will be thrown if the bubble end is set to almost
the same point as free end or if the vector from BubbleEnd -> FreeEnd
is not perpendicular to the normal vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.ReferencePlane.Name
The name property of the reference plane.
Remarks: This property overrides Element's default implementation.

Autodesk.Revit.DB.ReferencePlane
Represents a reference plane of Autodesk Revit.